[
  "What is the primary function of a multiplexer (MUX) in digital logic circuits?",
  "In the context of pipelined processor design, what constitutes a 'data hazard'?",
  "In the architecture of a System-on-Chip (SoC), what is the primary purpose of an 'interconnect fabric' (e.g., an AMBA AXI bus or Network-on-Chip)?",
  "In modern high-performance processors, what is the primary challenge that 'speculative execution' aims to mitigate?",
  "In the semiconductor manufacturing process, what is the primary function of 'photolithography' (or simply lithography)?",
  "What is the primary characteristic that distinguishes a Field-Programmable Gate Array (FPGA) from an Application-Specific Integrated Circuit (ASIC)?",
  "In computer architecture, what does the term \"microarchitecture\" primarily refer to?",
  "In the physical design phase of an integrated circuit, what is the primary purpose of Design Rule Checking (DRC)?",
  "In advanced out-of-order execution processors, what is the primary purpose of \"Register Renaming\"?",
  "What is the defining characteristic of a \"sequential logic circuit\" that distinguishes it from a \"combinational logic circuit\"?",
  "What is the primary function of a Phase-Locked Loop (PLL) or Delay-Locked Loop (DLL) in a synchronous digital system?",
  "In the context of Design-for-Testability (DFT) for digital integrated circuits, what is the primary purpose of 'scan chain insertion'?",
  "In multi-processor systems employing shared memory, which of the following statements best describes the guarantee provided by 'Sequential Consistency' as a memory consistency model?",
  "What is the fundamental difference in the design philosophy of a Complex Instruction Set Computer (CISC) versus a Reduced Instruction Set Computer (RISC) architecture?",
  "In digital logic and computer architecture, what is the primary function of a 'Register'?",
  "What is the fundamental building block of synchronous sequential logic circuits, capable of storing a single bit of information and changing its state only in response to a clock signal?",
  "In a write-back cache memory policy, under what primary condition is a modified (dirty) cache block typically written back to the main memory?",
  "After the logic synthesis step in the digital IC design flow, which specific formal verification technique is primarily used to mathematically prove that the generated gate-level netlist is functionally identical to its original Register Transfer Level (RTL) description?",
  "What is the fundamental distinction in how Very Long Instruction Word (VLIW) processors exploit Instruction-Level Parallelism (ILP) compared to traditional superscalar processors?",
  "After the physical layout (place and route) of an integrated circuit is completed, which critical step involves extracting all parasitic capacitances and resistances from the interconnects and devices, generating a detailed netlist that includes these parasitics for accurate post-layout timing and power analysis?",
  "What does ASIC stand for in the context of chip design?",
  "In pipelined processors with out-of-order execution, what is the primary purpose of a \"Reorder Buffer\" (ROB)?",
  "In the context of semiconductor manufacturing, what does \"Yield\" primarily refer to?",
  "Which of the following best describes the principle of \"Locality of Reference\" in computer architecture, particularly as it enables the effectiveness of cache memory?",
  "What is the fundamental difference between \"Static RAM (SRAM)\" and \"Dynamic RAM (DRAM)\" at a circuit level?",
  "What is the primary function of a buffer in digital circuits?",
  "Which timing parameter describes the minimum amount of time a synchronous data input must be stable *before* the active clock edge for a flip-flop to reliably capture the data?",
  "In the context of modern pipelined processors, what is the primary purpose of a 'branch predictor'?",
  "As a low-power design technique, why is reducing the supply voltage (VDD) particularly effective in reducing dynamic power consumption in CMOS digital circuits?",
  "In the semiconductor manufacturing process, what is the primary role of Chemical Mechanical Planarization (CMP)?",
  "What type of transistors are predominantly used as the fundamental switching elements in modern CMOS digital integrated circuits?",
  "In computer architecture, what is the primary role of the Instruction Set Architecture (ISA)?",
  "Which verification methodology in digital IC design involves applying a large volume of automatically generated, randomized input stimuli to the design under test (DUT) to uncover corner-case bugs, often guided by coverage metrics?",
  "In the physical design flow of digital integrated circuits, what is the primary objective of Clock Tree Synthesis (CTS)?",
  "In a multi-processor system with a shared memory model and private caches, what is the fundamental problem that a cache coherence protocol aims to solve?",
  "What does EDA stand for in the context of chip design and development?",
  "In the digital IC design flow, what is the primary objective of 'Logic Synthesis'?",
  "Which specialized hardware component, often part of a Memory Management Unit (MMU) in a CPU, is primarily responsible for caching recent virtual-to-physical address translations to speed up memory access?",
  "In the physical design of high-speed digital integrated circuits, what phenomenon describes the unwanted signal interference between adjacent interconnect wires, primarily due to parasitic capacitive coupling, which can lead to logic errors and timing violations?",
  "As a low-power design technique, what is the primary mechanism of 'power gating' in digital integrated circuits?",
  "In digital logic design, what is the primary function of a basic logic gate (e.g., AND, OR, NOT)?",
  "In the context of an Instruction Set Architecture (ISA), what does the \"opcode\" field within an instruction primarily specify?",
  "After the physical layout of an integrated circuit is complete, which verification step is crucial for ensuring that the implemented layout accurately matches the intended circuit schematic (netlist) by comparing connectivity and device properties?",
  "In a multi-core processor system utilizing the MESI cache coherence protocol, what does the \"Modified\" (M) state for a cache line primarily indicate?",
  "Which formal verification technique involves exhaustively exploring all reachable states of a finite-state system to verify if a given temporal logic property holds for all execution paths, often used for control logic verification?",
  "What is the primary function of the Arithmetic Logic Unit (ALU) in a Central Processing Unit (CPU)?",
  "In the digital IC design flow, what is the primary objective of Static Timing Analysis (STA)?",
  "Which technique is primarily employed in digital IC design to ensure reliable data transfer and prevent metastability when signals cross between asynchronously clocked domains?",
  "In the context of virtual memory management within a computer system, what is the primary function of a \"page table\"?",
  "What is the main advantage of implementing a hierarchical memory system (e.g., registers, caches, main memory, secondary storage) in computer architecture?"
]