[
  "Which of the following is considered a fundamental combinational logic gate?",
  "Which power optimization technique involves selectively disabling the clock signal to idle functional blocks or registers, thereby reducing dynamic power consumption?",
  "In modern CPU architectures, what is the primary architectural technique that allows a single processor to execute multiple instructions *concurrently* by dispatching them to multiple execution units in a single clock cycle, even if they are from a single instruction stream?",
  "To ensure a manufactured integrated circuit is free from manufacturing defects and operates correctly before shipment, which specialized design technique is primarily incorporated during the design phase to facilitate efficient post-silicon testing?",
  "Which type of semiconductor memory is typically used for the main system memory (RAM) in personal computers and servers, characterized by its high density and requirement for periodic refresh cycles?",
  "In digital ASIC design, what is the primary objective of the Clock Tree Synthesis (CTS) stage?",
  "In a computer system employing virtual memory, what is the primary function of a Translation Lookaside Buffer (TLB)?",
  "In advanced semiconductor manufacturing, what phenomenon describes the gradual displacement of metal atoms in an interconnect line due to momentum transfer from flowing electrons, potentially leading to open circuits or short circuits over time and reducing chip reliability?",
  "What does the Instruction Set Architecture (ISA) primarily define for a processor?",
  "In the context of hardware verification using languages like SystemVerilog, what is the primary role of an assertion?",
  "What is the primary material used as a semiconductor substrate in most modern integrated circuits?",
  "After logical synthesis in a typical digital IC design flow, what is the primary goal of the 'placement' step?",
  "Which type of memory retains its stored information even after power is removed, making it suitable for boot-up instructions and firmware in embedded systems?",
  "In advanced pipelined CPUs utilizing out-of-order execution, what is the primary purpose of *register renaming*?",
  "In the context of modern digital IC design, what does 'On-Chip Variation (OCV)' primarily refer to, and how is it typically handled in timing analysis?",
  "What is the primary function of a Multiplexer (MUX) in digital logic circuits?",
  "In the context of synchronous digital circuit timing, what does the 'setup time' of a flip-flop primarily refer to?",
  "Which architectural technique allows a processor to execute instructions out of their program order, speculatively executing operations before their control dependencies are resolved, and requires a rollback mechanism in case of mis-speculation?",
  "In modern System-on-Chip (SoC) designs, what is the primary purpose of Dynamic Voltage and Frequency Scaling (DVFS)?",
  "In semiconductor manufacturing, what is the primary goal of \"Yield Enhancement\" techniques?",
  "What does CMOS stand for in the context of digital integrated circuits?",
  "As technology nodes shrink, which electrical phenomenon becomes increasingly prominent in on-chip interconnects, causing significant signal delay and power consumption, often modeled as an RC network?",
  "In modern out-of-order processors, which architectural component is primarily responsible for reordering instructions to ensure they commit in program order, handle precise exceptions, and buffer results until commitment?",
  "In the context of leakage power reduction at advanced technology nodes, which technique involves dynamically adjusting the threshold voltage (Vt) of transistors by varying the substrate bias (body bias) to reduce subthreshold leakage currents?",
  "What is the primary purpose of 'Register-Transfer Level (RTL)' design in the digital IC design flow?",
  "In digital logic design, what is the primary function of a decoder circuit?",
  "In synchronous digital IC design, why is careful handling of Clock Domain Crossing (CDC) signals crucial for circuit correctness?",
  "What is the fundamental difference in how Static Random-Access Memory (SRAM) and Dynamic Random-Access Memory (DRAM) typically store a single bit of data?",
  "In a modern pipelined CPU architecture, what is the primary purpose of operand forwarding (also known as bypassing)?",
  "What is the primary role of Direct Memory Access (DMA) in a computer system?",
  "In the final stages of digital integrated circuit physical design, which verification step compares the extracted netlist from the physical layout against the original gate-level or RTL netlist to ensure functional equivalence?",
  "What is the primary characteristic of *memory-mapped I/O* in computer architecture, distinguishing it from isolated I/O?",
  "Which widely adopted Design-for-Testability (DFT) technique involves converting most sequential elements (e.g., flip-flops) into a shift register during test mode to allow for serial loading and unloading of internal state, thereby improving fault coverage?",
  "In a multiprocessor system, which concept defines the rules for how memory operations (reads and writes) from different processors are observed by other processors, establishing an ordering beyond just ensuring data values are consistent?",
  "What combinational logic circuit is primarily responsible for performing arithmetic addition of two binary numbers, along with a carry-in, and producing a sum and a carry-out?",
  "What is the primary role of a clock signal in a synchronous digital circuit?",
  "In digital IC design, what is the primary concern addressed by 'IR drop analysis'?",
  "In a computer system, what is the primary function of a Memory Management Unit (MMU)?",
  "In the physical verification phase of digital IC design, what is the primary objective of 'Layout Versus Schematic (LVS)'?",
  "In the context of multi-core processors, which advanced architectural paradigm aims to simplify concurrent programming by allowing multiple operations on shared data to execute speculatively and commit atomically, often relying on hardware support for conflict detection and rollback?",
  "What is the primary purpose of the Register File in a CPU's datapath?",
  "Which of the following best describes the relationship between a processor's Instruction Set Architecture (ISA) and its Microarchitecture?",
  "In the physical design phase of an integrated circuit, what is the primary objective of Design Rule Checking (DRC)?",
  "Which advanced power management technique involves dynamically shutting off the power supply to inactive functional blocks or entire power domains within an SoC to significantly reduce static (leakage) power consumption, often requiring power switches and isolation cells?",
  "According to Flynn's Taxonomy, which architectural classification describes a system where multiple processing elements execute the *same instruction* on *different data streams* simultaneously?",
  "What is the primary purpose of a cache memory in a computer system?",
  "In the digital IC design flow, which step is primarily responsible for transforming a Register-Transfer Level (RTL) description into an optimized gate-level netlist using a technology-specific standard cell library?",
  "In large-scale multiprocessor systems, what is the primary motivation for adopting a Non-Uniform Memory Access (NUMA) architecture?",
  "In synchronous digital circuit timing analysis, what is the 'critical path'?",
  "In the context of Application-Specific Integrated Circuit (ASIC) design, what is a \"standard cell\"?"
]