[
  "What does the acronym ASIC primarily represent in the context of chip design?",
  "In a CPU pipeline, what is a \"stall\" (or \"bubble\") primarily used to prevent?",
  "Which specialized circuit block is commonly used in System-on-Chip (SoC) designs to generate one or more output clock frequencies that are precise multiples or fractions of an input reference clock, often with phase alignment?",
  "After the physical layout of an integrated circuit is completed, which crucial verification step involves checking the layout against a set of predefined rules (e.g., minimum width, minimum spacing, enclosure) to ensure manufacturability and electrical correctness?",
  "Which characteristic primarily distinguishes Dynamic Random-Access Memory (DRAM) from Static Random-Access Memory (SRAM), necessitating periodic \"refresh\" operations for DRAM?",
  "What is the most widely used semiconductor material for fabricating integrated circuits in modern chip manufacturing?",
  "In the digital IC design flow, what is the primary role of the \"synthesis\" stage?",
  "In advanced low-power digital IC design, what is the primary purpose of \"power gating\"?",
  "In synchronous digital circuit design, what does the \"critical path\" primarily represent?",
  "In computer architecture, what does an Instruction Set Architecture (ISA) fundamentally define?",
  "What is the primary purpose of an 'IP core' (Intellectual Property core) in modern System-on-Chip (SoC) design?",
  "In synchronous digital design, what does the 'setup time' of a flip-flop primarily refer to?",
  "In a multi-processor system with private caches, what is the primary role of a 'cache coherence protocol'?",
  "Which characteristic is a primary advantage of using an Application-Specific Integrated Circuit (ASIC) over a Field-Programmable Gate Array (FPGA) for high-volume production of a specific digital function?",
  "In computer architecture, what is the primary function of general-purpose registers within the CPU?",
  "Which mathematical system is foundational for digital logic design, providing the framework for representing and manipulating logic operations?",
  "In computer architecture, what is the primary role of a \"register file\" within the Central Processing Unit (CPU)?",
  "In digital IC design, what does a \"Clock Domain Crossing (CDC)\" primarily refer to?",
  "What is the primary goal of Static Timing Analysis (STA) in the digital IC design flow?",
  "In computer architecture, what is the primary purpose of an \"interrupt\" mechanism?",
  "What is the fundamental building block of all digital circuits that performs a basic logical operation on one or more binary inputs to produce a single binary output?",
  "In a CPU pipeline, what type of hazard occurs when the outcome of a conditional branch instruction is not known until late in the pipeline, potentially requiring the pipeline to flush and restart if the prediction was incorrect?",
  "Which formal verification technique involves specifying desired circuit behavior using temporal logic properties (e.g., LTL or CTL) and then mathematically checking if the circuit's state machine model satisfies these properties for all possible inputs and states?",
  "In a system employing virtual memory, what is the primary purpose of a \"Translation Lookaside Buffer\" (TLB)?",
  "In the context of ASIC design methodologies, what is the key characteristic that distinguishes a \"Standard Cell\" design from a \"Full Custom\" design?",
  "What does Moore's Law primarily describe in the context of integrated circuits?",
  "What is the fundamental difference between combinational logic and sequential logic circuits?",
  "In computer architecture, what is the primary role of the Arithmetic Logic Unit (ALU)?",
  "How does Near-Threshold Computing (NTC) primarily aim to reduce power consumption in digital circuits?",
  "In digital IC design verification, what is the primary purpose of an assertion (e.g., using SystemVerilog Assertions - SVA)?",
  "What is the primary function of a clock signal in synchronous digital circuits?",
  "What is the primary characteristic that differentiates a Harvard architecture from a Von Neumann architecture?",
  "What is the primary role of 'functional simulation' in the front-end digital IC design flow?",
  "What is dynamic voltage and frequency scaling (DVFS) primarily used for in modern processors?",
  "In chip design reliability, what does 'Electromigration' primarily refer to?",
  "What is the primary purpose of a 'technology library' (also known as a standard cell library) in the context of digital IC design synthesis?",
  "In a pipelined processor, what is the primary technique used to mitigate data hazards (RAW dependencies) by directly passing the result of an instruction from one pipeline stage to an earlier stage, bypassing the register file write-back?",
  "What is the main distinction between 'clock gating' and 'power gating' as low-power design techniques in digital integrated circuits?",
  "In the context of computer architecture, what kind of cache miss occurs when a block is evicted from the cache to make room for another block, and then the evicted block is needed again later, even if the cache has enough total capacity to hold all blocks required by the program if they were mapped differently (e.g., in a fully associative cache)?",
  "What is the primary function of the Memory Management Unit (MMU) in a computer system?",
  "What is the primary abstraction level used for describing the functional behavior of a digital circuit before synthesis in the ASIC design flow?",
  "Which cache mapping policy offers the highest flexibility in placing a memory block anywhere in the cache but requires the most complex hardware for address lookup?",
  "During the post-synthesis or post-layout stages of digital IC design, which type of simulation incorporates propagation delays and interconnect parasitics to verify timing correctness in addition to functional behavior?",
  "In modern deep submicron IC manufacturing, what is the primary challenge associated with the increasing variability of process parameters across different dies and even within a single die, leading to potential performance and power deviations?",
  "In advanced digital IC verification, what is the primary purpose of 'functional coverage'?",
  "What is the primary advantage of FinFET (Fin Field-Effect Transistor) devices over traditional planar MOSFETs in modern deep submicron technology nodes?",
  "In the context of digital Integrated Circuit (IC) design, what is the main purpose of inserting 'scan chains' during the Design for Testability (DFT) phase?",
  "In a multi-processor system with private caches, what is the fundamental characteristic that distinguishes a 'snooping' cache coherence protocol from a 'directory-based' protocol?",
  "Which formal verification technique specifically focuses on mathematically proving that two different representations of a digital circuit (e.g., a Register-Transfer Level (RTL) description and a synthesized gate-level netlist) are functionally equivalent?",
  "What is the primary advantage of using a floating-point number representation (like the IEEE 754 standard) over a fixed-point representation in computer architecture?"
]