[
  "Which of the following logic gates provides a HIGH output only when all of its inputs are HIGH?",
  "Which instruction set architecture (ISA) philosophy typically features a smaller, highly optimized set of instructions, each designed to execute in a single clock cycle, favoring software complexity over hardware complexity?",
  "In the context of digital IC design, what is the primary purpose of inserting scan chains into a circuit?",
  "For future many-core processors and System-on-Chips (SoCs), which communication architecture is increasingly preferred over traditional bus-based interconnects to provide scalable, high-bandwidth, and low-latency communication between intellectual property (IP) blocks and processor cores?",
  "To accurately predict timing performance and yield for designs at advanced process nodes, where process variations introduce significant uncertainty in gate delays and wire resistances, which analysis technique extends traditional Static Timing Analysis (STA) by modeling delays as probability distributions rather than single worst-case values?",
  "What is the primary contributor to dynamic power consumption in CMOS digital circuits?",
  "In the physical design phase of a digital integrated circuit, what is the primary objective of \"floorplanning\"?",
  "Which architectural technique allows a processor to execute instructions in an order different from their original program sequence, as long as data dependencies are respected, to keep execution units busy and improve performance?",
  "What phenomenon in integrated circuits primarily refers to the transport of material caused by the gradual movement of metal atoms in a conductor due to the momentum transfer from colliding electrons, leading to potential open or short circuits over time?",
  "In computer architecture, what is the primary mechanism by which an external event or an internal program condition (like a division by zero) can temporarily suspend the current program execution to allow the CPU to handle the event?",
  "In digital IC design, what is the primary purpose of a \"standard cell library\"?",
  "In a computer system utilizing virtual memory, what is the fundamental role of a \"page table\"?",
  "In synchronous digital circuits, what phenomenon describes a flip-flop entering an unstable, intermediate state for an indeterminate amount of time, often occurring when setup or hold time requirements are violated, or when synchronizing asynchronous inputs?",
  "At advanced technology nodes (e.g., 14nm and below), FinFETs (Fin Field-Effect Transistors) largely replaced traditional planar MOSFETs. What is the primary advantage of a FinFET over a planar MOSFET that addresses challenges of continued scaling?",
  "In the physical design flow of a digital integrated circuit, particularly during logic synthesis and place-and-route, what is the primary objective of \"gate sizing\"?",
  "What is the primary purpose of a clock signal in a synchronous digital circuit?",
  "In the context of Design for Testability (DFT) for Integrated Circuits and Printed Circuit Boards (PCBs), what is the primary purpose of the JTAG (IEEE 1149.1) standard, commonly known as Boundary Scan?",
  "In a multi-processor system with private caches, which cache coherence protocol typically invalidates other copies of a data block when a write occurs to ensure consistency?",
  "In advanced semiconductor devices, what is a \"soft error\" primarily caused by, and what is its main characteristic compared to a \"hard error\"?",
  "Which page replacement algorithm guarantees the lowest possible page fault rate for a given reference string, but is generally impractical to implement in real operating systems?",
  "Which of the following fundamental logic gates produces an output that is the logical inverse (complement) of its single input?",
  "In digital IC verification, what is the primary advantage of employing formal verification techniques (e.g., model checking, equivalence checking) compared to traditional simulation-based verification?",
  "What is the primary reason why Dynamic Random-Access Memory (DRAM) is typically used for a computer's main memory (RAM), while Static Random-Access Memory (SRAM) is preferred for CPU caches?",
  "Which power reduction technique in digital IC design involves selectively disabling the clock signal to specific registers or functional blocks when their outputs are not required to change, thus reducing dynamic power consumption?",
  "In the microarchitecture of a typical Central Processing Unit (CPU), what is the primary function of the \"Register File\"?",
  "Which of the following is an example of a volatile memory type, meaning its contents are lost when power is removed?",
  "In the digital IC design flow, what is the primary goal of achieving 'timing closure'?",
  "In a MOSFET, what does the 'threshold voltage' (Vt) primarily represent?",
  "In a system with multiple devices sharing a common bus (e.g., a memory bus), what is the primary role of a 'bus arbiter'?",
  "In the context of digital IC verification, what does 'functional coverage' primarily measure?",
  "What is the primary purpose of a Hardware Description Language (HDL) like Verilog or VHDL in digital IC design?",
  "In the context of pipelined processors, what is a 'data hazard' primarily caused by?",
  "Which technique is primarily used in advanced System-on-Chip (SoC) power management to completely cut off power to inactive functional blocks, thereby eliminating both static and dynamic power consumption in those regions?",
  "What is the fundamental difference in purpose and application between an Application-Specific Integrated Circuit (ASIC) and a Field-Programmable Gate Array (FPGA)?",
  "In the design of high-speed digital interconnects and PCB traces, what phenomenon refers to the bouncing back of a signal at points of impedance mismatch along a transmission line, which can lead to signal integrity issues like overshoot, undershoot, and ringing?",
  "What is the fundamental purpose of a flip-flop in digital circuits?",
  "In the context of computer architecture, what is the primary role of a \"pipeline\" in a CPU?",
  "In an out-of-order CPU microarchitecture, what is the main function of a \"Reorder Buffer\" (ROB)?",
  "What is the primary challenge that drives the increasing adoption of 3D IC stacking (e.g., through-silicon vias - TSVs) in modern chip design?",
  "Which of the following best describes the primary goal of \"Register Transfer Level (RTL)\" design in the digital IC design flow?",
  "What is the primary function of a multiplexer (MUX) in digital circuits?",
  "In the context of CPU cache memory, what is the primary characteristic of a 'write-back' policy?",
  "In digital IC verification, what is the primary purpose of 'Formal Equivalence Checking (FEC)'?",
  "Which memory consistency model guarantees that all memory operations appear to execute in some sequential order, and that the order of operations from a single processor is preserved in this sequential order, making it the strongest (most intuitive) but potentially slowest model?",
  "At advanced technology nodes, what is 'Negative Bias Temperature Instability (NBTI)' primarily known for affecting in PMOS transistors, leading to performance degradation over time?",
  "What is the primary purpose of doping in semiconductor manufacturing?",
  "In a pipelined CPU, what is the primary role of a branch predictor?",
  "In CMOS digital circuits, what is the primary source of static power dissipation?",
  "In the physical verification phase of a digital IC design, what is the primary objective of a Design Rule Check (DRC)?",
  "In the context of CPU caches, what is the primary advantage of a 'set-associative' cache over a 'direct-mapped' cache?"
]