[
  "What does ASIC stand for in the context of chip design?",
  "In pipelined processors with out-of-order execution, what is the primary purpose of a \"Reorder Buffer\" (ROB)?",
  "In the context of semiconductor manufacturing, what does \"Yield\" primarily refer to?",
  "Which of the following best describes the principle of \"Locality of Reference\" in computer architecture, particularly as it enables the effectiveness of cache memory?",
  "What is the fundamental difference between \"Static RAM (SRAM)\" and \"Dynamic RAM (DRAM)\" at a circuit level?",
  "What is the primary function of a buffer in digital circuits?",
  "Which timing parameter describes the minimum amount of time a synchronous data input must be stable *before* the active clock edge for a flip-flop to reliably capture the data?",
  "In the context of modern pipelined processors, what is the primary purpose of a 'branch predictor'?",
  "As a low-power design technique, why is reducing the supply voltage (VDD) particularly effective in reducing dynamic power consumption in CMOS digital circuits?",
  "In the semiconductor manufacturing process, what is the primary role of Chemical Mechanical Planarization (CMP)?",
  "What type of transistors are predominantly used as the fundamental switching elements in modern CMOS digital integrated circuits?",
  "In computer architecture, what is the primary role of the Instruction Set Architecture (ISA)?",
  "Which verification methodology in digital IC design involves applying a large volume of automatically generated, randomized input stimuli to the design under test (DUT) to uncover corner-case bugs, often guided by coverage metrics?",
  "In the physical design flow of digital integrated circuits, what is the primary objective of Clock Tree Synthesis (CTS)?",
  "In a multi-processor system with a shared memory model and private caches, what is the fundamental problem that a cache coherence protocol aims to solve?",
  "What does EDA stand for in the context of chip design and development?",
  "In the digital IC design flow, what is the primary objective of 'Logic Synthesis'?",
  "Which specialized hardware component, often part of a Memory Management Unit (MMU) in a CPU, is primarily responsible for caching recent virtual-to-physical address translations to speed up memory access?",
  "In the physical design of high-speed digital integrated circuits, what phenomenon describes the unwanted signal interference between adjacent interconnect wires, primarily due to parasitic capacitive coupling, which can lead to logic errors and timing violations?",
  "As a low-power design technique, what is the primary mechanism of 'power gating' in digital integrated circuits?",
  "In digital logic design, what is the primary function of a basic logic gate (e.g., AND, OR, NOT)?",
  "In the context of an Instruction Set Architecture (ISA), what does the \"opcode\" field within an instruction primarily specify?",
  "After the physical layout of an integrated circuit is complete, which verification step is crucial for ensuring that the implemented layout accurately matches the intended circuit schematic (netlist) by comparing connectivity and device properties?",
  "In a multi-core processor system utilizing the MESI cache coherence protocol, what does the \"Modified\" (M) state for a cache line primarily indicate?",
  "Which formal verification technique involves exhaustively exploring all reachable states of a finite-state system to verify if a given temporal logic property holds for all execution paths, often used for control logic verification?",
  "What is the primary function of the Arithmetic Logic Unit (ALU) in a Central Processing Unit (CPU)?",
  "In the digital IC design flow, what is the primary objective of Static Timing Analysis (STA)?",
  "Which technique is primarily employed in digital IC design to ensure reliable data transfer and prevent metastability when signals cross between asynchronously clocked domains?",
  "In the context of virtual memory management within a computer system, what is the primary function of a \"page table\"?",
  "What is the main advantage of implementing a hierarchical memory system (e.g., registers, caches, main memory, secondary storage) in computer architecture?",
  "What is the fundamental component used to implement all logic functions (AND, OR, NOT) in CMOS digital circuits?",
  "What is the primary purpose of a 'test bench' in the context of digital IC design verification?",
  "In computer architecture, what is the primary role of the 'Control Unit' (CU) within a CPU?",
  "What is the primary purpose of Error-Correcting Code (ECC) memory in high-reliability systems?",
  "What is the main benefit of employing 'virtual memory' in a computer system?",
  "What is the primary purpose of \"floorplanning\" in the physical design stage of an Application-Specific Integrated Circuit (ASIC) or custom IC?",
  "In cache memory systems, what is the primary advantage of a \"set-associative\" cache over a \"direct-mapped\" cache of the same total size?",
  "Which of the following best describes the phenomenon known as \"clock skew\" in synchronous digital circuits?",
  "In a modern out-of-order superscalar processor, which of the following best describes the primary function of the \"Instruction Window\" (also known as the Reservation Station)?",
  "Which advanced transistor technology is primarily characterized by a 3D gate structure that wraps around the channel on multiple sides, significantly improving electrostatic control and reducing leakage currents compared to planar transistors at smaller process nodes?",
  "What does FPGA stand for in the context of chip design?",
  "In the physical design stage of an Integrated Circuit, what is the primary objective of the \"placement\" step?",
  "In a classic five-stage RISC pipeline (Fetch, Decode, Execute, Memory, Write-back), what is the primary purpose of \"data forwarding\" (also known as bypassing)?",
  "What is the primary objective of Dynamic Voltage and Frequency Scaling (DVFS) in modern processors and SoCs?",
  "In a typical computer system, what is the primary function of \"main memory\" (often implemented with DRAM)?",
  "What is the primary role of a Register Transfer Level (RTL) description in the initial stages of digital IC design?",
  "What is the primary benefit of using instruction pipelining in a Central Processing Unit (CPU)?",
  "In the physical layout of a complex digital integrated circuit, what is the primary function of a robust power delivery network (often implemented as power grids or planes)?",
  "In digital logic circuits, what is the primary function of a multiplexer (MUX)?",
  "What is the primary function of the Memory Management Unit (MMU) in a modern CPU?"
]