[
  "What is the defining characteristic of a digital signal compared to an analog signal in electronics?",
  "In computer architecture, what is the primary purpose of an 'interrupt' mechanism?",
  "In digital IC verification, what is the main objective of achieving 'functional coverage'?",
  "In the physical design flow of a digital integrated circuit, what is the primary reason for inserting buffers into a signal net?",
  "In a pipelined processor, what is a 'data hazard' primarily caused by?",
  "What is the primary function of a flip-flop in digital sequential circuits?",
  "In the context of a processor's memory hierarchy, what is the primary role of a Memory Management Unit (MMU)?",
  "What is 'formal verification' primarily used for in digital IC design?",
  "What is the fundamental advantage of using FinFET (Fin Field-Effect Transistor) technology over traditional planar MOSFETs in advanced semiconductor nodes (e.g., 16nm and below)?",
  "In a System-on-Chip (SoC) design, what is the primary purpose of a 'boot ROM'?",
  "What is the fastest type of memory directly accessible by the CPU, typically used to store data for immediate processing during instruction execution?",
  "In synchronous digital circuits, what is 'hold time' primarily associated with?",
  "In semiconductor manufacturing, what is the primary purpose of Optical Proximity Correction (OPC) within the photolithography process?",
  "Beyond simply extending address space, what is a crucial benefit of virtual memory systems in modern operating systems, primarily achieved through the Memory Management Unit (MMU)?",
  "Which type of integrated circuit is designed for a specific application by masking during fabrication, offering high performance and low power for that task, but is not reconfigurable after manufacturing?",
  "What is the primary function of a multiplexer (MUX) in digital logic design?",
  "In pipelined processor design, what is a 'structural hazard'?",
  "What is the primary role of an 'arbiter' in a multi-master, multi-slave communication system within a System-on-Chip (SoC)?",
  "In the context of VLSI design, what is 'Design Technology Co-Optimization (DTCO)' primarily concerned with?",
  "Which of the following is a key characteristic of a Von Neumann architecture?",
  "What is the primary purpose of a \"register file\" in a Central Processing Unit (CPU)?",
  "What is the primary benefit of \"speculative execution\" in modern pipelined processors?",
  "In the physical design phase of a digital integrated circuit, what is the main objective of \"Clock Tree Synthesis (CTS)\"?",
  "In the context of computer memory systems, what does the principle of \"Temporal Locality\" primarily imply?",
  "What is the primary challenge or phenomenon addressed by the concept of \"dark silicon\" in advanced many-core chip design?",
  "What is the output of a 2-input NAND gate when both inputs are logically HIGH (1)?",
  "In a pipelined processor, which type of hazard is primarily associated with conditional branch instructions and can lead to incorrect instruction fetching if not handled properly?",
  "In the physical design flow of a digital integrated circuit, after routing is complete, what is the primary purpose of 'parasitic extraction'?",
  "In the context of cache memory write policies, what is the primary characteristic of a \"write-back\" (or copy-back) policy?",
  "In semiconductor manufacturing and reliability, what is the phenomenon where momentum transfer from high-velocity electrons causes gradual displacement of metal atoms within integrated circuit interconnects, potentially leading to open circuits or short circuits over the device's lifetime?",
  "What is the primary function of the Arithmetic Logic Unit (ALU) within a Central Processing Unit (CPU)?",
  "During the logic synthesis phase of digital IC design, what is the main goal of \"technology mapping\"?",
  "In the context of processor design, what does the term \"Instruction Set Architecture (ISA)\" primarily define?",
  "Which of the following describes the primary challenge addressed by \"double patterning\" (or multi-patterning) techniques in advanced semiconductor manufacturing?",
  "In a modern synchronous digital system, what is the primary purpose of a \"Phase-Locked Loop (PLL)\"?",
  "What is the primary purpose of Hardware Description Languages (HDLs) like Verilog or VHDL in digital IC design?",
  "In a set-associative cache, when a cache miss occurs and the target set is already full, which mechanism determines which existing cache block is replaced to make space for the new data block?",
  "Dynamic Voltage and Frequency Scaling (DVFS) is a widely used power management technique in modern processors. What is its primary mechanism for achieving power reduction?",
  "After the physical layout of an integrated circuit is completed, what crucial verification steps are performed to ensure that the layout adheres to manufacturing rules and accurately represents the logical design?",
  "In a typical pipelined processor, which functional unit is primarily responsible for interpreting the fetched instruction and generating the necessary control signals to direct other components (such as the ALU, register file, and memory) to perform the specified operation?",
  "What is the primary function of a clock signal in a synchronous digital circuit?",
  "What is the main advantage of an Instruction Set Architecture (ISA) that supports a Reduced Instruction Set Computing (RISC) philosophy compared to a Complex Instruction Set Computing (CISC) philosophy for processor microarchitecture?",
  "In the context of asynchronous digital circuit design, what is a primary design consideration that distinguishes it from synchronous design?",
  "Which statement best describes the role of \"micro-operations\" (or \"micro-ops\") within the pipeline of a modern Complex Instruction Set Computer (CISC) processor?",
  "What is the primary purpose of a \"Standard Cell Library\" in the automated digital integrated circuit (IC) physical design flow?",
  "What is the output of an XOR gate when one input is logically HIGH (1) and the other input is logically LOW (0)?",
  "What is the primary advantage of using a Field-Programmable Gate Array (FPGA) over an Application-Specific Integrated Circuit (ASIC) during the early stages of product development and prototyping?",
  "In a multi-processor system with private caches, what is the primary role of a cache coherence protocol (e.g., MESI, MOESI)?",
  "In the physical design flow of a digital integrated circuit, which of the following best describes the primary objective of the *placement* stage?",
  "In a modern superscalar processor implementing out-of-order execution, what role does the Reorder Buffer (ROB) primarily play?"
]