[
  "What is a key characteristic of a *combinational logic circuit*?",
  "In a CPU, what is the primary function of the *Translation Lookaside Buffer (TLB)*?",
  "In the physical verification phase of an integrated circuit design, what is the main purpose of *Design Rule Checking (DRC)*?",
  "In multi-processor systems, which statement best describes a *weak consistency model* for memory?",
  "In Static Timing Analysis (STA), what does a *positive slack* value on a timing path indicate?",
  "What is the output of a 2-input NAND gate if both inputs are HIGH (logic 1)?",
  "In cache memory systems, which write policy dictates that data is written only to the cache and marked as 'dirty', with updates to main memory occurring only when the cache line is evicted or replaced?",
  "In a modern pipelined processor, what is the primary function of the Branch Target Buffer (BTB)?",
  "Which Design for Testability (DFT) technique is standardized as IEEE 1149.1 and enables structured testing of interconnects on a printed circuit board (PCB) as well as internal logic of compliant ICs via a serial interface?",
  "To reduce static and dynamic power consumption in inactive parts of an SoC, which low-power design technique involves switching off the power supply to specific blocks or domains when they are not in use?",
  "What is the primary role of an Instruction Set Architecture (ISA) in computer architecture?",
  "In the typical digital IC design flow, what is the main objective of the 'logic synthesis' step?",
  "Which of Flynn's classifications for computer architectures describes systems capable of executing multiple, distinct instruction streams on multiple, independent data streams simultaneously, often found in multi-core processors?",
  "In the context of CPU cache memory, which replacement policy discards the cache line that has been in the cache for the longest duration, regardless of how recently it was accessed?",
  "For p-type MOSFETs (PMOS) in advanced technology nodes, what specific reliability mechanism causes a gradual increase in threshold voltage (Vth) over time when the device is under a constant negative gate-to-source voltage and elevated temperature?",
  "In a multi-processor system with private caches, what is the primary purpose of a cache coherence protocol?",
  "When using a Hardware Description Language (HDL) like Verilog or VHDL, what is the fundamental difference in the outcome between simulating a design and synthesizing it for an ASIC or FPGA?",
  "In computer architecture, when an interrupt occurs, what mechanism does the CPU typically use to determine which interrupt service routine (ISR) to execute?",
  "In Static Timing Analysis (STA) of a digital circuit, what does a *negative slack* value on a critical path signify?",
  "Which of the following statements best describes a key difference between a Field-Programmable Gate Array (FPGA) and an Application-Specific Integrated Circuit (ASIC)?",
  "What is the primary function of a multiplexer (MUX) in digital design?",
  "What is the primary purpose of a *write buffer* in a CPU's memory system?",
  "What is the primary goal of a `Clock Tree Synthesis (CTS)` step in the physical design flow of an Application-Specific Integrated Circuit (ASIC)?",
  "In a directory-based cache coherence protocol, what is the primary function of the 'directory'?",
  "In digital circuit design, what is the primary reason for performing `glitch analysis`?",
  "In a CPU, what is the primary function of the Arithmetic Logic Unit (ALU)?",
  "In a pipelined processor, which type of hazard occurs when an instruction needs to read data that a previous instruction in the pipeline has not yet written back to the register file or memory?",
  "Which of the following is a primary challenge or consideration in the design of asynchronous digital circuits, compared to synchronous circuits?",
  "In the reliability analysis of integrated circuits, what phenomenon describes the gradual transport of metal atoms in an interconnect line due to momentum transfer from electrons flowing through it, often leading to opens or shorts over time, particularly exacerbated by high current densities and elevated temperatures?",
  "Which advanced verification technique mathematically proves the correctness of a design against a formal specification, exploring all possible input combinations and states, rather than relying on simulating a finite set of test vectors?",
  "What is the primary role of a clock signal in a synchronous digital circuit?",
  "When designing a CPU cache, increasing its associativity (e.g., from direct-mapped to 2-way set-associative) primarily aims to reduce which of the following?",
  "In the context of semiconductor manufacturing and yield management, what does the term 'Die Yield' primarily refer to?",
  "What is the primary goal of *speculative execution* in a modern superscalar processor?",
  "In digital IC design, what is the main benefit of implementing *clock gating*?",
  "In the context of ASIC design, what is the primary purpose of a 'standard cell library'?",
  "What is a key architectural characteristic that primarily distinguishes Reduced Instruction Set Computing (RISC) from Complex Instruction Set Computing (CISC)?",
  "In advanced digital IC verification, what is the specific objective of 'Formal Equivalence Checking (LEC)'?",
  "When designing a digital integrated circuit with multiple independent clock sources, what is the primary role of a 'Clock Domain Crossing (CDC)' circuit?",
  "In a modern out-of-order superscalar processor, what is the main purpose of 'register renaming'?",
  "What does CMOS stand for in the context of digital integrated circuits?",
  "What is the primary purpose of *virtual memory* in a modern operating system and CPU architecture?",
  "In deep sub-micron integrated circuit design, what is *crosstalk* primarily concerned with?",
  "In a pipelined processor, what is the main purpose of *data forwarding* (also known as *bypassing*)?",
  "Which statement best describes the fundamental approach of *model checking* as a formal verification technique in digital IC design?",
  "What is the primary function of a flip-flop in digital circuit design?",
  "In the physical design phase of an integrated circuit, what is the main goal of the `floorplanning` step?",
  "Which of the following best describes the purpose of a *branch predictor* in a pipelined CPU?",
  "In the context of chip manufacturing, what is `Design for Manufacturability (DFM)` primarily concerned with?",
  "What is the primary role of a `Reservation Station` in a Tomasulo's algorithm-based out-of-order processor?"
]