[
  "What is the primary function of a multiplexer (MUX) in digital design?",
  "What is the primary purpose of a *write buffer* in a CPU's memory system?",
  "What is the primary goal of a `Clock Tree Synthesis (CTS)` step in the physical design flow of an Application-Specific Integrated Circuit (ASIC)?",
  "In a directory-based cache coherence protocol, what is the primary function of the 'directory'?",
  "In digital circuit design, what is the primary reason for performing `glitch analysis`?",
  "In a CPU, what is the primary function of the Arithmetic Logic Unit (ALU)?",
  "In a pipelined processor, which type of hazard occurs when an instruction needs to read data that a previous instruction in the pipeline has not yet written back to the register file or memory?",
  "Which of the following is a primary challenge or consideration in the design of asynchronous digital circuits, compared to synchronous circuits?",
  "In the reliability analysis of integrated circuits, what phenomenon describes the gradual transport of metal atoms in an interconnect line due to momentum transfer from electrons flowing through it, often leading to opens or shorts over time, particularly exacerbated by high current densities and elevated temperatures?",
  "Which advanced verification technique mathematically proves the correctness of a design against a formal specification, exploring all possible input combinations and states, rather than relying on simulating a finite set of test vectors?",
  "What is the primary role of a clock signal in a synchronous digital circuit?",
  "When designing a CPU cache, increasing its associativity (e.g., from direct-mapped to 2-way set-associative) primarily aims to reduce which of the following?",
  "In the context of semiconductor manufacturing and yield management, what does the term 'Die Yield' primarily refer to?",
  "What is the primary goal of *speculative execution* in a modern superscalar processor?",
  "In digital IC design, what is the main benefit of implementing *clock gating*?",
  "In the context of ASIC design, what is the primary purpose of a 'standard cell library'?",
  "What is a key architectural characteristic that primarily distinguishes Reduced Instruction Set Computing (RISC) from Complex Instruction Set Computing (CISC)?",
  "In advanced digital IC verification, what is the specific objective of 'Formal Equivalence Checking (LEC)'?",
  "When designing a digital integrated circuit with multiple independent clock sources, what is the primary role of a 'Clock Domain Crossing (CDC)' circuit?",
  "In a modern out-of-order superscalar processor, what is the main purpose of 'register renaming'?",
  "What does CMOS stand for in the context of digital integrated circuits?",
  "What is the primary purpose of *virtual memory* in a modern operating system and CPU architecture?",
  "In deep sub-micron integrated circuit design, what is *crosstalk* primarily concerned with?",
  "In a pipelined processor, what is the main purpose of *data forwarding* (also known as *bypassing*)?",
  "Which statement best describes the fundamental approach of *model checking* as a formal verification technique in digital IC design?",
  "What is the primary function of a flip-flop in digital circuit design?",
  "In the physical design phase of an integrated circuit, what is the main goal of the `floorplanning` step?",
  "Which of the following best describes the purpose of a *branch predictor* in a pipelined CPU?",
  "In the context of chip manufacturing, what is `Design for Manufacturability (DFM)` primarily concerned with?",
  "What is the primary role of a `Reservation Station` in a Tomasulo's algorithm-based out-of-order processor?",
  "What is the primary purpose of Boolean algebra in digital circuit design?",
  "In pipelined processors, what is the primary function of a pipeline register (or inter-stage buffer)?",
  "What does the term 'process variation' primarily refer to in the context of semiconductor manufacturing?",
  "Which type of memory is volatile, typically constructed using capacitors and transistors, and requires periodic refresh cycles to retain its data?",
  "In a modern out-of-order execution processor, what is the primary role of the Reorder Buffer (ROB)?",
  "Which fundamental digital logic gate produces a HIGH (logic 1) output if *at least one* of its inputs is HIGH?",
  "In the physical verification phase of digital IC design, what is the primary purpose of 'Layout Versus Schematic (LVS)'?",
  "In a CPU's memory management unit (MMU), what is the primary function of the Translation Lookaside Buffer (TLB)?",
  "Which semiconductor reliability mechanism describes the gradual degradation of MOSFET device characteristics, such as transconductance and threshold voltage, due to highly energetic electrons or holes (hot carriers) becoming trapped in the gate oxide or at the silicon-oxide interface, particularly prevalent under high electric fields near the drain?",
  "In a typical Field-Programmable Gate Array (FPGA) architecture, what is the primary role of a Look-Up Table (LUT)?",
  "In digital logic design, what is the fundamental characteristic that distinguishes *sequential logic circuits* from *combinational logic circuits*?",
  "In digital integrated circuit design, what is the primary purpose of incorporating *scan chains* as part of Design for Testability (DFT)?",
  "In computer architecture and parallel computing, what does *Amdahl's Law* primarily quantify?",
  "In the physical design flow of a digital integrated circuit, what is the primary goal of the 'placement' step?",
  "Which of the following best describes a key characteristic that distinguishes a *vector processor* from a traditional scalar processor?",
  "What is the primary purpose of the Program Counter (PC) in a CPU?",
  "In digital IC design, what is the primary advantage of using a Static Random-Access Memory (SRAM) over a Dynamic Random-Access Memory (DRAM) for on-chip caches?",
  "What is a 'control hazard' in a pipelined processor?",
  "In the physical design flow of an Application-Specific Integrated Circuit (ASIC), what is the primary goal of the 'Routing' step?",
  "What does the term 'NBTI' refer to as a reliability concern in advanced CMOS integrated circuits?"
]