[
  "Which of the following is commonly used to graphically represent the input-output relationship of a combinational logic circuit?",
  "In an out-of-order execution processor, what is the primary purpose of 'register renaming'?",
  "In the context of System-on-Chip (SoC) design, what is the primary role of the Advanced eXtensible Interface (AXI) protocol (part of ARM's AMBA specification)?",
  "In modern deep submicron IC manufacturing, what is the primary purpose of Optical Proximity Correction (OPC)?",
  "What is the primary function of a 'parity bit' in digital systems, often used in memory or communication?",
  "What is the fundamental building block of most digital circuits that stores a single bit of information and can be set or reset based on clock signals?",
  "In the context of semiconductor manufacturing, what is 'doping' primarily used for?",
  "Which of the following describes the architectural technique where a processor attempts to guess the outcome of a conditional jump (branch) and proceeds to execute instructions along the predicted path before the actual outcome is known?",
  "What is the primary purpose of a 'timing constraint' (e.g., `set_input_delay`, `set_output_delay`, `create_clock`) in a digital IC design flow, particularly during synthesis and place & route?",
  "In the context of computer memory, what does the term 'write-through' primarily refer to in a cache memory system?",
  "What is the primary function of the Arithmetic Logic Unit (ALU) in a Central Processing Unit (CPU)?",
  "In digital IC design, what is the primary purpose of Static Timing Analysis (STA)?",
  "Which cache replacement policy evicts the block that has not been accessed for the longest period of time?",
  "In modern System-on-Chip (SoC) designs, what is the primary challenge that Clock Domain Crossing (CDC) verification aims to address?",
  "What is a fundamental design philosophy difference between a Reduced Instruction Set Computer (RISC) and a Complex Instruction Set Computer (CISC) architecture?",
  "What is the fundamental characteristic that distinguishes combinational logic circuits from sequential logic circuits?",
  "In the physical design phase of an integrated circuit, what is the primary purpose of Design Rule Checking (DRC)?",
  "In a cache coherence protocol like MESI (Modified, Exclusive, Shared, Invalid), what does the 'Modified' state of a cache line primarily indicate?",
  "In advanced deep submicron integrated circuit design, what reliability concern does 'Electromigration' primarily address?",
  "In a Central Processing Unit (CPU), what is the primary role of the Instruction Decoder?",
  "What does CMOS primarily stand for in the context of digital integrated circuit design?",
  "In digital IC design, what is the primary purpose of implementing 'power gating'?",
  "What is the primary function of a Translation Lookaside Buffer (TLB) in a computer system?",
  "What is the primary challenge addressed by Statistical Static Timing Analysis (SSTA) compared to traditional Static Timing Analysis (STA)?",
  "In a Non-Uniform Memory Access (NUMA) architecture, what is the primary characteristic that distinguishes memory access times?",
  "Which pair of logic gates are considered \"universal gates\" because any other Boolean function can be implemented using only gates of that type?",
  "In the physical design phase of an Integrated Circuit (IC), what is the primary purpose of 'floorplanning'?",
  "In a virtual memory system, what is the primary role of a 'page table'?",
  "In an out-of-order execution processor, what is the primary function of the 'Reorder Buffer' (ROB)?",
  "In advanced semiconductor manufacturing, what does \"Process-Voltage-Temperature (PVT) variation\" primarily refer to in the context of IC design?",
  "What is the primary purpose of a \"standard cell library\" in Application-Specific Integrated Circuit (ASIC) design?",
  "In a cache memory system, what does \"associativity\" primarily refer to?",
  "In Design-for-Testability (DFT) methodologies, what is the primary purpose of inserting \"scan chains\" into a digital circuit?",
  "In modern out-of-order execution processors, what mechanism is primarily used to ensure \"precise exceptions\" even when instructions complete out of program order?",
  "Which advanced low-power design technique dynamically adjusts both the operating voltage and frequency of a processor core to optimize power consumption based on workload demands?",
  "What type of power consumption occurs in a digital integrated circuit even when the circuit is idle and not switching, primarily due to leakage currents through transistors?",
  "In computer architecture, what does the term 'endianness' primarily refer to?",
  "What is the primary motivation for the transition from planar MOSFETs to FinFET (Fin Field-Effect Transistor) architecture in modern semiconductor manufacturing, especially at advanced process nodes?",
  "In digital IC design verification, what is the primary role of an Assertion-Based Verification (ABV) methodology?",
  "In a cache memory system, what is the primary characteristic of a 'direct-mapped cache'?",
  "What is the primary characteristic distinguishing synchronous digital circuits from asynchronous digital circuits?",
  "In digital IC design verification, what is the primary purpose of a 'test bench'?",
  "In Static Timing Analysis (STA), what does the 'critical path' primarily represent?",
  "In a multiprocessor system, which concept primarily deals with ensuring that all processors see a consistent view of shared memory, especially when data is cached locally by individual processors?",
  "In digital IC design, what level of abstraction does Register Transfer Level (RTL) primarily represent?",
  "In the context of a System-on-Chip (SoC), what is the primary role of the Phase-Locked Loop (PLL)?",
  "Which verification methodology exhaustively proves the correctness of a digital design against its specification using mathematical and logical techniques, without relying on simulation of test vectors?",
  "In a pipelined processor, what technique is primarily used to mitigate the performance impact of data hazards by forwarding the result of an operation from an earlier pipeline stage to a later stage that needs it, without waiting for the result to be written back to the register file?",
  "At advanced technology nodes (e.g., 7nm, 5nm), what phenomenon primarily refers to the unintentional electrical coupling between adjacent wires or circuit components on a chip, leading to signal integrity issues like crosstalk, increased delays, or false switching?",
  "In Hardware Description Languages (HDLs) like Verilog, what is the primary characteristic and typical use of a 'blocking assignment' (e.g., using the `=` operator) when modeling digital logic?"
]