[
  "In a cache memory system, which write policy dictates that data is primarily updated only in the cache, and writes to main memory are delayed until the cache block is evicted or explicitly flushed?",
  "During the physical design phase of an integrated circuit, which phenomenon arises when routing multiple signal wires in close proximity, leading to unwanted capacitive coupling and interference between adjacent traces, potentially causing signal integrity issues?",
  "Which fundamental digital logic gate produces a HIGH output (logic 1) if and only if its two inputs are different?",
  "In modern superscalar processors employing out-of-order execution, what is the primary architectural mechanism that allows the processor to dispatch and execute instructions when their operands are ready, even if they appear later in the program sequence, thereby improving instruction-level parallelism?",
  "In advanced functional verification of complex System-on-Chip (SoC) designs, which methodology uses pseudo-random stimulus generation guided by a set of user-defined rules and constraints to explore a wide range of operational scenarios and uncover corner-case bugs more efficiently than directed tests?",
  "Which two fundamental logic gates are considered 'universal gates' because any other Boolean function can be implemented solely using multiple instances of one type of these gates?",
  "In a pipelined processor, what is a 'control hazard' (also known as a branch hazard)?",
  "In modern System-on-Chip (SoC) designs, what is the primary purpose of Dynamic Voltage and Frequency Scaling (DVFS)?",
  "After synthesis, the gate-level netlist needs to be verified against the original Register Transfer Level (RTL) design. Which formal verification technique is primarily used to mathematically prove that these two representations are functionally identical?",
  "In a multi-core processor system using a cache coherence protocol, what additional state does the MOESI protocol introduce compared to the MESI protocol, and what is its primary benefit?",
  "What does Moore's Law primarily predict about integrated circuits?",
  "In digital IC physical design, what is the primary purpose of 'floorplanning'?",
  "What is the main architectural goal of employing Instruction-Level Parallelism (ILP) techniques in a processor?",
  "In modern out-of-order superscalar processors, what is the primary role of a Reorder Buffer (ROB)?",
  "What is the primary advantage of employing asynchronous design methodologies over synchronous design, particularly for very high-speed or ultra-low-power applications?",
  "What is the primary purpose of a \"Netlist\" in digital IC design?",
  "In a pipelined processor, what is the primary purpose of \"branch prediction\"?",
  "Which of the following best describes the primary role of \"synthesis\" in the digital IC design flow?",
  "In post-layout timing analysis, what is the significance of \"On-Chip Variation (OCV)\"?",
  "What is the primary function of a \"Reservation Station\" in a modern out-of-order execution processor?",
  "What is the primary purpose of a \"photomask\" (or reticle) in semiconductor manufacturing?",
  "What does \"clock skew\" primarily refer to in synchronous digital circuits, and why is it a significant concern?",
  "In a multi-processor system, which memory consistency model generally allows a processor to read its own previously written value immediately, but delays the visibility of writes from other processors until explicit synchronization points, offering a trade-off for improved performance?",
  "Beyond Dynamic Voltage and Frequency Scaling (DVFS), which common low-power design technique involves selectively disabling the clock signal to inactive portions of a circuit or module to reduce dynamic power consumption?",
  "In the context of a processor's instruction set architecture (ISA), which category of instructions is primarily responsible for moving data between registers and memory (e.g., LOAD and STORE operations)?",
  "Which of the following describes the process of converting a high-level Register Transfer Level (RTL) description (e.g., written in VHDL or Verilog) into a gate-level netlist composed of standard logic cells?",
  "In synchronous digital circuits, what specific condition arises when a flip-flop's input signal changes too close to the clock edge, leading to an indeterminate output state that can take an unusually long time to settle?",
  "In a processor's memory hierarchy, what is the primary role of the Translation Lookaside Buffer (TLB)?",
  "What is the primary objective of 'power gating' as a low-power design technique in digital integrated circuits?",
  "In advanced superscalar processors, which architectural component is responsible for holding instructions after they are decoded, waiting for their operands to become available before dispatching them for execution to appropriate functional units, enabling out-of-order execution?",
  "What is the primary function of a decoder in digital logic circuits?",
  "In a cache memory system, what does 'associativity' primarily refer to?",
  "What is the primary purpose of Built-In Self-Test (BIST) in digital IC design?",
  "In multi-processor systems, what is a key characteristic and primary challenge of a Non-Uniform Memory Access (NUMA) architecture?",
  "In advanced semiconductor manufacturing, which reliability phenomenon describes the transport of material atoms in a conductor due to the momentum transfer from electrons, leading to the formation of voids and hills that can eventually cause open circuits or short circuits?",
  "Which hardware description language (HDL) is widely used for modeling and describing digital circuits at the Register Transfer Level (RTL) for chip design?",
  "In a Central Processing Unit (CPU), which component is primarily responsible for performing arithmetic operations (like addition, subtraction) and logical operations (like AND, OR) on data?",
  "Which step in the physical design flow of an Application-Specific Integrated Circuit (ASIC) involves assigning specific locations on the silicon die for each logic gate or macro block, followed by connecting them with wires, aiming to optimize for area, performance, and power?",
  "Beyond its role in mapping virtual to physical addresses, which key capability does a virtual memory system provide by allowing programs to access more memory than physically available, and by isolating the memory spaces of different processes from each other?",
  "In static timing analysis (STA) for synchronous digital circuits, what is the term for the maximum time a data signal can be unstable or change at a flip-flop's input *after* the active clock edge and still be reliably captured?",
  "What is the primary function of the Control Unit within a Central Processing Unit (CPU)?",
  "In CMOS integrated circuits, which parasitic phenomenon can lead to a low-impedance path between power and ground rails, potentially causing excessive current draw and device damage, often triggered by transient over-voltage or over-current conditions?",
  "In cache memory design, which replacement policy aims to evict the block that has not been used for the longest period of time, in an effort to minimize future cache misses?",
  "Which formal verification technique involves specifying desired behaviors or properties of a design using a formal language (like SystemVerilog Assertions - SVA) and then mathematically proving or disproving whether the design satisfies these properties across all possible input sequences?",
  "In a pipelined processor, what type of hazard occurs when two or more instructions require the same hardware resource (e.g., an adder unit or a memory port) at the same time in the same clock cycle?",
  "What is the primary function of a multiplexer (MUX) in digital logic circuits?",
  "In the context of pipelined processor design, what constitutes a 'data hazard'?",
  "In the architecture of a System-on-Chip (SoC), what is the primary purpose of an 'interconnect fabric' (e.g., an AMBA AXI bus or Network-on-Chip)?",
  "In modern high-performance processors, what is the primary challenge that 'speculative execution' aims to mitigate?",
  "In the semiconductor manufacturing process, what is the primary function of 'photolithography' (or simply lithography)?"
]