[
  "What is the primary characteristic of an FPGA (Field-Programmable Gate Array) that distinguishes it from an ASIC (Application-Specific Integrated Circuit)?",
  "In the physical design flow of a digital integrated circuit, what is the main objective of the 'placement' stage?",
  "Which memory consistency model ensures that all memory operations appear to execute in some sequential order, and that the operations of each individual processor appear in program order?",
  "What is the primary cause of Negative Bias Temperature Instability (NBTI) in p-MOSFETs, leading to a degradation in performance (e.g., threshold voltage shift, reduced drive current) over time?",
  "In the context of an Instruction Set Architecture (ISA), what is the primary role of the 'opcode'?",
  "In the semiconductor manufacturing process, what is the primary role of photolithography?",
  "In a pipelined processor, what is the primary goal of a branch predictor?",
  "In synchronous digital circuit design, what does the \"setup time\" of a flip-flop primarily refer to?",
  "What is the primary advantage of 3D Integrated Circuits (3D ICs) over traditional 2D planar ICs, particularly concerning inter-die communication?",
  "In a multi-core processor system, what is the primary motivation for employing relaxed memory consistency models instead of strictly sequential consistency?",
  "Which of the following is a fundamental building block of sequential logic circuits, capable of storing a single bit of information and changing its state only at the rising or falling edge of a clock signal?",
  "In a typical computer system's memory hierarchy, what is the primary purpose of having multiple levels of cache (e.g., L1, L2, L3)?",
  "In the physical design flow of a digital integrated circuit, after the 'placement' stage, what is the primary objective of the 'routing' stage?",
  "Which architectural technique allows a processor to execute multiple instructions in a single clock cycle by fetching, decoding, and executing several independent instructions concurrently?",
  "At advanced technology nodes (e.g., sub-20nm), what fundamental challenge in MOSFET scaling does 'Short Channel Effect' primarily refer to, impacting transistor performance and reliability?",
  "What is the primary function of a multiplexer (MUX) in digital logic circuits?",
  "In a multi-core processor system, what is the primary purpose of a 'write-back' cache policy, as opposed to a 'write-through' policy?",
  "In Hardware Description Languages (HDLs) like Verilog, what is the primary characteristic and typical use of a 'non-blocking assignment' (e.g., using the `<=` operator) when modeling sequential digital logic?",
  "What phenomenon, often observed in n-MOSFETs, involves high-energy electrons or holes getting injected into the gate oxide, leading to threshold voltage shift and degradation of device performance over time?",
  "What architectural technique allows a processor to achieve instruction-level parallelism (ILP) by discovering independent instructions from *multiple* program threads and executing them concurrently on shared functional units?",
  "What is the defining characteristic of a combinational logic circuit?",
  "In a computer system employing virtual memory, what is the primary purpose of a Translation Lookaside Buffer (TLB)?",
  "In synchronous digital circuit design, a 'hold time violation' in a flip-flop primarily occurs when:",
  "In the context of digital IC design using Hardware Description Languages (HDLs), what is the primary purpose of 'linting' an RTL design?",
  "Which architectural paradigm is primarily employed by modern GPUs to achieve massive parallelism, where multiple independent threads execute the same instruction simultaneously on different data?",
  "What is the primary function of the Arithmetic Logic Unit (ALU) within a Central Processing Unit (CPU)?",
  "In Static Timing Analysis (STA), what is the primary purpose of analyzing a design across different 'process, voltage, and temperature (PVT) corners'?",
  "In the physical design flow of a digital integrated circuit, what is the primary objective of Clock Tree Synthesis (CTS)?",
  "What is the primary benefit of speculative execution in modern high-performance processors?",
  "In advanced semiconductor manufacturing, what is the primary concern addressed by Design for Manufacturability (DFM) techniques?",
  "Which of the following logic gates provides a HIGH output only when all of its inputs are HIGH?",
  "Which instruction set architecture (ISA) philosophy typically features a smaller, highly optimized set of instructions, each designed to execute in a single clock cycle, favoring software complexity over hardware complexity?",
  "In the context of digital IC design, what is the primary purpose of inserting scan chains into a circuit?",
  "For future many-core processors and System-on-Chips (SoCs), which communication architecture is increasingly preferred over traditional bus-based interconnects to provide scalable, high-bandwidth, and low-latency communication between intellectual property (IP) blocks and processor cores?",
  "To accurately predict timing performance and yield for designs at advanced process nodes, where process variations introduce significant uncertainty in gate delays and wire resistances, which analysis technique extends traditional Static Timing Analysis (STA) by modeling delays as probability distributions rather than single worst-case values?",
  "What is the primary contributor to dynamic power consumption in CMOS digital circuits?",
  "In the physical design phase of a digital integrated circuit, what is the primary objective of \"floorplanning\"?",
  "Which architectural technique allows a processor to execute instructions in an order different from their original program sequence, as long as data dependencies are respected, to keep execution units busy and improve performance?",
  "What phenomenon in integrated circuits primarily refers to the transport of material caused by the gradual movement of metal atoms in a conductor due to the momentum transfer from colliding electrons, leading to potential open or short circuits over time?",
  "In computer architecture, what is the primary mechanism by which an external event or an internal program condition (like a division by zero) can temporarily suspend the current program execution to allow the CPU to handle the event?",
  "In digital IC design, what is the primary purpose of a \"standard cell library\"?",
  "In a computer system utilizing virtual memory, what is the fundamental role of a \"page table\"?",
  "In synchronous digital circuits, what phenomenon describes a flip-flop entering an unstable, intermediate state for an indeterminate amount of time, often occurring when setup or hold time requirements are violated, or when synchronizing asynchronous inputs?",
  "At advanced technology nodes (e.g., 14nm and below), FinFETs (Fin Field-Effect Transistors) largely replaced traditional planar MOSFETs. What is the primary advantage of a FinFET over a planar MOSFET that addresses challenges of continued scaling?",
  "In the physical design flow of a digital integrated circuit, particularly during logic synthesis and place-and-route, what is the primary objective of \"gate sizing\"?",
  "What is the primary purpose of a clock signal in a synchronous digital circuit?",
  "In the context of Design for Testability (DFT) for Integrated Circuits and Printed Circuit Boards (PCBs), what is the primary purpose of the JTAG (IEEE 1149.1) standard, commonly known as Boundary Scan?",
  "In a multi-processor system with private caches, which cache coherence protocol typically invalidates other copies of a data block when a write occurs to ensure consistency?",
  "In advanced semiconductor devices, what is a \"soft error\" primarily caused by, and what is its main characteristic compared to a \"hard error\"?",
  "Which page replacement algorithm guarantees the lowest possible page fault rate for a given reference string, but is generally impractical to implement in real operating systems?"
]