[
  "In digital logic design, what is the fundamental characteristic that distinguishes *sequential logic circuits* from *combinational logic circuits*?",
  "In digital integrated circuit design, what is the primary purpose of incorporating *scan chains* as part of Design for Testability (DFT)?",
  "In computer architecture and parallel computing, what does *Amdahl's Law* primarily quantify?",
  "In the physical design flow of a digital integrated circuit, what is the primary goal of the 'placement' step?",
  "Which of the following best describes a key characteristic that distinguishes a *vector processor* from a traditional scalar processor?",
  "What is the primary purpose of the Program Counter (PC) in a CPU?",
  "In digital IC design, what is the primary advantage of using a Static Random-Access Memory (SRAM) over a Dynamic Random-Access Memory (DRAM) for on-chip caches?",
  "What is a 'control hazard' in a pipelined processor?",
  "In the physical design flow of an Application-Specific Integrated Circuit (ASIC), what is the primary goal of the 'Routing' step?",
  "What does the term 'NBTI' refer to as a reliability concern in advanced CMOS integrated circuits?",
  "At which abstraction level are digital circuits typically described using Hardware Description Languages (HDLs) like Verilog or VHDL for functional specification, where the design is represented in terms of registers and the data flow between them, prior to logic synthesis?",
  "In the context of CPU cache memory design, which write policy ensures that all write operations update both the cache block and the corresponding main memory location simultaneously?",
  "In the digital IC design flow, particularly during the physical design and sign-off phases, what is the primary objective of performing Static Timing Analysis (STA)?",
  "What is the primary motivation behind the design and implementation of a memory hierarchy (e.g., registers, multiple levels of cache, main memory, disk storage) in a modern computer system?",
  "In modern computer architecture, what is the primary goal of Simultaneous Multithreading (SMT), a technique exemplified by Intel's Hyper-Threading, when implemented on a single processor core?",
  "What is the primary output of the logic synthesis phase in the digital IC design flow?",
  "In a multi-processor system with shared memory, what is the primary purpose of a cache coherence protocol?",
  "In high-speed digital integrated circuits, what is the primary concern addressed by careful design of the power delivery network (PDN), including on-chip decoupling capacitors and robust power/ground straps?",
  "In concurrent programming and multi-processor systems, what does a 'memory consistency model' primarily define?",
  "Which Design for Testability (DFT) technique involves embedding test logic within the circuit itself to generate test patterns and analyze responses internally, reducing reliance on external Automated Test Equipment (ATE) for manufacturing testing?",
  "What is the primary purpose of a multiplexer (MUX) in digital circuit design?",
  "In a pipelined processor, what is the fundamental purpose of dividing an instruction's execution into multiple stages?",
  "What is the primary goal of Clock Tree Synthesis (CTS) during the physical design phase of an integrated circuit?",
  "What is the main architectural challenge addressed by implementing a Non-Uniform Memory Access (NUMA) architecture in multi-processor systems?",
  "Which type of simulation primarily verifies the logical behavior and functional correctness of a digital circuit design using abstract models (e.g., Register-Transfer Level), before detailed timing or physical characteristics are known?",
  "What is the defining characteristic of an XOR (Exclusive OR) logic gate's output when its two inputs are identical?",
  "In an out-of-order execution processor, what is the primary function of the Load/Store Queue (LSQ)?",
  "In the physical verification and sign-off stages of advanced integrated circuit design, what is the primary purpose of Electromigration (EM) analysis?",
  "In a typical Field-Programmable Gate Array (FPGA) architecture, what is the main functional unit that combines Look-Up Tables (LUTs) with flip-flops to implement both combinational and sequential logic?",
  "Which of the following best describes the fundamental characteristic of non-volatile memory?",
  "What is the primary role of an Arithmetic Logic Unit (ALU) within a Central Processing Unit (CPU)?",
  "In the physical design flow of an integrated circuit, what is the main objective of 'timing closure'?",
  "Which memory characteristic best describes the ability to access any memory location in roughly the same amount of time, regardless of its physical address?",
  "In synchronous digital design, what does the 'setup time' of a flip-flop primarily specify?",
  "In a pipelined processor, what constitutes a 'structural hazard'?",
  "What is the primary function of a transistor in a digital integrated circuit?",
  "What is formal verification primarily used for in digital IC design?",
  "Which of the following is a primary characteristic of a Reduced Instruction Set Computer (RISC) architecture compared to a Complex Instruction Set Computer (CISC) architecture?",
  "What is the primary motivation behind the adoption of 'chiplet' architectures in modern semiconductor design?",
  "What is the primary purpose of 'clock gating' in digital IC design?",
  "What is the fundamental building block for sequential logic circuits that can store a single bit of information?",
  "In cache memory design, what is the primary purpose of a 'dirty bit' associated with a cache line?",
  "In the physical design verification phase of an integrated circuit, what is the primary purpose of Design Rule Checking (DRC)?",
  "In modern out-of-order execution processors, what is the primary goal of employing 'speculative execution'?",
  "For advanced technology nodes (e.g., 3nm and beyond), Gate-All-Around (GAA) FETs are often preferred over FinFETs. What is the primary advantage of GAAFETs in this context?",
  "Which element is the primary semiconductor material used in the vast majority of modern integrated circuits?",
  "In digital CMOS integrated circuits, which component of power consumption is primarily due to the charging and discharging of load capacitances as gates switch their logic states?",
  "In a set-associative cache memory organization, how is a main memory block typically mapped to a cache location?",
  "What is the primary motivation for adopting a 'Globally Asynchronous, Locally Synchronous' (GALS) design style in complex System-on-Chip (SoC) designs?",
  "In modern System-on-Chip (SoC) designs, what is the primary advantage of using a Network-on-Chip (NoC) architecture over traditional bus-based interconnects?"
]