[
  "What is the primary purpose of a \"photomask\" (or reticle) in semiconductor manufacturing?",
  "What does \"clock skew\" primarily refer to in synchronous digital circuits, and why is it a significant concern?",
  "In a multi-processor system, which memory consistency model generally allows a processor to read its own previously written value immediately, but delays the visibility of writes from other processors until explicit synchronization points, offering a trade-off for improved performance?",
  "Beyond Dynamic Voltage and Frequency Scaling (DVFS), which common low-power design technique involves selectively disabling the clock signal to inactive portions of a circuit or module to reduce dynamic power consumption?",
  "In the context of a processor's instruction set architecture (ISA), which category of instructions is primarily responsible for moving data between registers and memory (e.g., LOAD and STORE operations)?",
  "Which of the following describes the process of converting a high-level Register Transfer Level (RTL) description (e.g., written in VHDL or Verilog) into a gate-level netlist composed of standard logic cells?",
  "In synchronous digital circuits, what specific condition arises when a flip-flop's input signal changes too close to the clock edge, leading to an indeterminate output state that can take an unusually long time to settle?",
  "In a processor's memory hierarchy, what is the primary role of the Translation Lookaside Buffer (TLB)?",
  "What is the primary objective of 'power gating' as a low-power design technique in digital integrated circuits?",
  "In advanced superscalar processors, which architectural component is responsible for holding instructions after they are decoded, waiting for their operands to become available before dispatching them for execution to appropriate functional units, enabling out-of-order execution?",
  "What is the primary function of a decoder in digital logic circuits?",
  "In a cache memory system, what does 'associativity' primarily refer to?",
  "What is the primary purpose of Built-In Self-Test (BIST) in digital IC design?",
  "In multi-processor systems, what is a key characteristic and primary challenge of a Non-Uniform Memory Access (NUMA) architecture?",
  "In advanced semiconductor manufacturing, which reliability phenomenon describes the transport of material atoms in a conductor due to the momentum transfer from electrons, leading to the formation of voids and hills that can eventually cause open circuits or short circuits?",
  "Which hardware description language (HDL) is widely used for modeling and describing digital circuits at the Register Transfer Level (RTL) for chip design?",
  "In a Central Processing Unit (CPU), which component is primarily responsible for performing arithmetic operations (like addition, subtraction) and logical operations (like AND, OR) on data?",
  "Which step in the physical design flow of an Application-Specific Integrated Circuit (ASIC) involves assigning specific locations on the silicon die for each logic gate or macro block, followed by connecting them with wires, aiming to optimize for area, performance, and power?",
  "Beyond its role in mapping virtual to physical addresses, which key capability does a virtual memory system provide by allowing programs to access more memory than physically available, and by isolating the memory spaces of different processes from each other?",
  "In static timing analysis (STA) for synchronous digital circuits, what is the term for the maximum time a data signal can be unstable or change at a flip-flop's input *after* the active clock edge and still be reliably captured?",
  "What is the primary function of the Control Unit within a Central Processing Unit (CPU)?",
  "In CMOS integrated circuits, which parasitic phenomenon can lead to a low-impedance path between power and ground rails, potentially causing excessive current draw and device damage, often triggered by transient over-voltage or over-current conditions?",
  "In cache memory design, which replacement policy aims to evict the block that has not been used for the longest period of time, in an effort to minimize future cache misses?",
  "Which formal verification technique involves specifying desired behaviors or properties of a design using a formal language (like SystemVerilog Assertions - SVA) and then mathematically proving or disproving whether the design satisfies these properties across all possible input sequences?",
  "In a pipelined processor, what type of hazard occurs when two or more instructions require the same hardware resource (e.g., an adder unit or a memory port) at the same time in the same clock cycle?",
  "What is the primary function of a multiplexer (MUX) in digital logic circuits?",
  "In the context of pipelined processor design, what constitutes a 'data hazard'?",
  "In the architecture of a System-on-Chip (SoC), what is the primary purpose of an 'interconnect fabric' (e.g., an AMBA AXI bus or Network-on-Chip)?",
  "In modern high-performance processors, what is the primary challenge that 'speculative execution' aims to mitigate?",
  "In the semiconductor manufacturing process, what is the primary function of 'photolithography' (or simply lithography)?",
  "What is the primary characteristic that distinguishes a Field-Programmable Gate Array (FPGA) from an Application-Specific Integrated Circuit (ASIC)?",
  "In computer architecture, what does the term \"microarchitecture\" primarily refer to?",
  "In the physical design phase of an integrated circuit, what is the primary purpose of Design Rule Checking (DRC)?",
  "In advanced out-of-order execution processors, what is the primary purpose of \"Register Renaming\"?",
  "What is the defining characteristic of a \"sequential logic circuit\" that distinguishes it from a \"combinational logic circuit\"?",
  "What is the primary function of a Phase-Locked Loop (PLL) or Delay-Locked Loop (DLL) in a synchronous digital system?",
  "In the context of Design-for-Testability (DFT) for digital integrated circuits, what is the primary purpose of 'scan chain insertion'?",
  "In multi-processor systems employing shared memory, which of the following statements best describes the guarantee provided by 'Sequential Consistency' as a memory consistency model?",
  "What is the fundamental difference in the design philosophy of a Complex Instruction Set Computer (CISC) versus a Reduced Instruction Set Computer (RISC) architecture?",
  "In digital logic and computer architecture, what is the primary function of a 'Register'?",
  "What is the fundamental building block of synchronous sequential logic circuits, capable of storing a single bit of information and changing its state only in response to a clock signal?",
  "In a write-back cache memory policy, under what primary condition is a modified (dirty) cache block typically written back to the main memory?",
  "After the logic synthesis step in the digital IC design flow, which specific formal verification technique is primarily used to mathematically prove that the generated gate-level netlist is functionally identical to its original Register Transfer Level (RTL) description?",
  "What is the fundamental distinction in how Very Long Instruction Word (VLIW) processors exploit Instruction-Level Parallelism (ILP) compared to traditional superscalar processors?",
  "After the physical layout (place and route) of an integrated circuit is completed, which critical step involves extracting all parasitic capacitances and resistances from the interconnects and devices, generating a detailed netlist that includes these parasitics for accurate post-layout timing and power analysis?",
  "What does ASIC stand for in the context of chip design?",
  "In pipelined processors with out-of-order execution, what is the primary purpose of a \"Reorder Buffer\" (ROB)?",
  "In the context of semiconductor manufacturing, what does \"Yield\" primarily refer to?",
  "Which of the following best describes the principle of \"Locality of Reference\" in computer architecture, particularly as it enables the effectiveness of cache memory?",
  "What is the fundamental difference between \"Static RAM (SRAM)\" and \"Dynamic RAM (DRAM)\" at a circuit level?"
]